Tekla Open API Reference for Tekla Structures 2025
CrossSection.Select Method
Overload List
Name | Description
Select(Double, Double)
 Selects the cross section from the profile definition.
Select(Boolean, Double, Double)
 Selects the cross section from the profile definition.
Top
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace